app/controllers/collborators_controller.rb

  def index
    @collborators = Collborator.all
---
SELECT "collborators".* FROM "collborators"

  def create
    @collborator = Collborator.new(collborator_params)

    respond_to do |format|
      if @collborator.save
---
INSERT INTO "collborators" ("comments", "created_at", "first_name", "last_name", "project_link", "updated_at", "year") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @collborator.update(collborator_params)
---
UPDATE "collborators" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "collborators"."id" = 2  [["first_name", "Garey"], ["last_name", "Simpson"], ["updated_at", "2014-08-02 18:51:46.112570"]]

    def set_collborator
      @collborator = Collborator.find(params[:id])
---
SELECT  "collborators".* FROM "collborators"  WHERE "collborators"."id" = ? LIMIT 1  [["id", 2]]